{"id":{"6919390":6239553,"1907050":6990393,"7920754":8661369,"4806489":6257604,"7586201":8127271,"8358457":5852300,"4253254":4219217,"5204205":10039848,"5538932":5871153,"5885800":3324982,"6476779":3472077,"1193520":1088996,"7102282":1324991,"3006718":10026260,"1053288":8817348,"6297861":862535,"2383498":5599547,"3379236":6406400,"2544125":8484671,"7077300":7304909,"8338896":7117407,"3450108":9472113,"7876314":7674782,"7080513":6752985,"1433165":7905178,"5366147":7508068,"6942329":6766327,"247135":1393908,"7346926":10229189,"1762775":8122831,"5965413":9044879,"7687409":5501388,"5037548":49689,"4519948":7360495,"2665333":8152138,"4618303":5945771,"623834":8726958,"3619347":5552773,"2817715":1034999,"2776881":325675,"2510928":1335820,"4505071":8168756,"6711279":245469,"4537277":3853890,"6026747":6968715,"4858533":8083198,"5846040":3345889,"4621519":3954395,"3588632":1363220,"6814109":5554966,"1367130":2678631,"1702439":10143672,"609132":4903178,"2874332":4835508,"2798324":2825998,"6945104":8696190,"804961":9686685,"5392737":4683772,"3577628":5150818,"8166065":9548783,"806058":7202620,"3209539":10082816,"1505093":8433397,"3589314":9565219,"7593525":7453287,"8041608":9948329,"1198632":368085,"12844":9259651,"7985559":7446821,"4780410":2684997,"59473":7733026,"7129412":6937855,"3420420":5074950,"3447803":3857299,"3679104":5498099,"3084483":9628123,"6704407":7719593,"6455944":1112594,"2922172":1091014,"7058780":6532092,"6778898":7507065,"5951719":1754742,"5066024":849228,"6304528":6592844,"1205539":4224529,"7008040":8365523,"3111037":3241840,"1183776":1909793,"8009837":2621385,"3673788":7391004,"3798395":6323411,"5386997":3209451,"8212604":5395218,"7759142":7604076,"2901579":1513448,"7980782":4468428,"7141726":5802382,"1872293":5938217,"5866007":284949,"7440507":9390718},"by":{"6919390":"mierle","1907050":"skylan_q","7920754":"Thriptic","4806489":"losethos","7586201":"yaronl_elh","8358457":"1123581321","4253254":"pdeuchler","5204205":"zx2c4","5538932":"md224","5885800":"jayeff","6476779":"josefrichter","1193520":"ThinkWriteMute","7102282":"apphacker","3006718":null,"1053288":"BrainInAJar","6297861":"hughprime","2383498":"yekko","3379236":"mrschwabe","2544125":"jerf","7077300":"yummyfajitas","8338896":"sp332","3450108":"geebee","7876314":"josephschmoe","7080513":"objclxt","1433165":"spolu","5366147":"riggins","6942329":"scheff","247135":"jrockway","7346926":"jpollock","1762775":"orware","5965413":"AustinScript","7687409":"ChuckMcM","5037548":"nanijoe","4519948":"TehCorwiz","2665333":"adwf","4618303":"LarryMade2","623834":"k__","3619347":"rayiner","2817715":"wallflower","2776881":"mynameishere","2510928":"lr","4505071":"cbhl","6711279":"jfarmer","4537277":"tptacek","6026747":"gress","4858533":"Nursie","5846040":"abscondment","4621519":"MartinCron","3588632":"thunk","6814109":"stretchwithme","1367130":"mcantelon","1702439":"mattdesl","609132":"trhtrsh","2874332":"tsotha","2798324":"mindcrime","6945104":"23david","804961":"bquinlan","5392737":"gm","3577628":"neya","8166065":null,"806058":"mindcrime","3209539":"e12e","1505093":"valarauca1","3589314":"laumars","7593525":"rwallace","8041608":"black_knight","1198632":"tlrobinson","12844":"aofstad","7985559":"stefantalpalaru","4780410":"mirkules","59473":"daned","7129412":"pjscott","3420420":"johansch","3447803":"corin_","3679104":"pathy","3084483":null,"6704407":"virtualwhys","6455944":"calcnerd256","2922172":null,"7058780":"adamnemecek","6778898":"walshemj","5951719":"niqolas","5066024":"maxcap","6304528":"bdavisx","1205539":"smacktoward","7008040":"vijaykumar13","3111037":"orangecat","1183776":"MisterWebz","8009837":"cpeterso","3673788":"romanovcode","3798395":"kbutler","5386997":"andre3k1","8212604":"ewolf","7759142":"robg","2901579":"dcurtis","7980782":"encoderer","7141726":"douglasisshiny","1872293":"plywoodtrees","5866007":"justncr3dibl3","7440507":"darkmighty"},"text":{"6919390":"Sorry, I messed up the link and can&#x27;t change it.","1907050":"I stopped reading this partway through because PG doesn&#x27;t really need to explain himself here. Don&#x27;t attribute to malice what you can attribute to your own misunderstanding.","7920754":"It&#x27;s all relative. I live close to my parents, and have the privilege of having dinner with them about once every other week. Meanwhile, if I&#x27;m lucky, I get to see my best friend who lives far away once every 6 months. Given this disparity, I would greatly prefer hanging out with my friend during the holidays rather than burning vacation days spending time with my nuclear family (who I see often) and extended family (who I am not close with at all) just because tradition dictates that I should do so.","4806489":"C:\\TAD\\Text\\WALDEN.TXT<p>-- &quot;Make kneaded bread thus.  Wash your hands and trough well.  Put\nthe meal into the trough, add water gradually, and knead it\nthoroughly.  When you have kneaded it well, mould it, and bake it\nunder a cover,&quot; that is, in a baking kettle.  Not a word about\nleaven.  But I did not always use this staff of life.  At one time,\nowing to the emptiness of my purse, I saw none of it for more than a\nmonth.\n    Every New Englander might easily raise all his own breadstuffs\nin this land of rye and Indian cor","7586201":"Not as successful as the other ones here, but it&#x27;s starting to show promise. <a href=\"http:\/\/mynativemap.com\/\" rel=\"nofollow\">http:&#x2F;&#x2F;mynativemap.com&#x2F;<\/a><p>I created it to help people that can&#x27;t surf into Google Map&#x27;s in their own language. the link&#x27;s forces the selected language manually and ignore the automatic language detection.<p>Started a few months ago and it&#x27;s already covering my hosting in ad revenue. hopefully I&#x27;ll have better numbers to report on the next Round of &quot;...best passive income..&quot; :)","8358457":"It&#x27;s on the list, too, but I (possibly incorrectly) see Chef and Ansible having a more similar philosophy and workflow to each other than to Puppet so I am hoping to eliminate one of them.","4253254":"Is it?<p>In my interpretation it is the content of the listings, not the compilation. He could compile the data from several different sources and present the same result.","5204205":"Finally, ECC memory on a laptop!","5538932":"really curious what you mean when you say rape can be &quot;needed&quot;...","5885800":"When I got my current laptop about 1 1\/2 years ago I didn't install an ad-blocker (or NoScript or FlashBlock) and really don't care anymore. Ads improved over the last view years.<p>My solution for sites with crazy ad banners\/skyscrapers (too colorful, too much movement or - worst of all - play sound) is simply to stop visiting them. Sidenote: If I tend  to somehow return over and over again they get an entry in \/etc\/hosts).<p>And yes, pop-ups are blocked (as it's default in Chrome)","6476779":"Funny as hell how they closed that issue with \"trying to stop flamewar\" comment :D :D","1193520":"I'd love to see an educational micro-kernel OS, something like L4.","7102282":"An email client with copy and paste would be great, and zoom.","3006718":null,"1053288":"it is possible to agree with the general tone of an article while still disagreeing with some of the finer points.","6297861":" I have nothing against golf as a game, and I've played it a few times myself, but the idea that there's <i>this<\/i> much money floating around just in sticking logos on the shirts of guys who hit balls into holes to persuade other guys to buy new sticks with which to hit other balls into holes makes me feel like there's an awful lot of money being wasted.","2383498":"You actually need above market salary at startup since there is no bonus or anything else.<p>A 15% bonus + 401k match + ESPP + yearly stock grant can easily equal 40k+ for a junior (1-3 year exp) employee.","3379236":"Apparently your internet browsing data is not enough, Google also wants your medical records and DNA.<p>Seriously though, I wouldn&#x27;t trust any company connected with Google for &#x27;health and well being&#x27;.  Their total disregard for privacy would imply they are not working in my best interest for health either.","2544125":"Then my point is even more important given the proportion of it actually spent on infectious diseases. If that&#x27;s <i>so allfired important<\/i> than why were they doing anything else with that money?<p>The answer, of course, is that it wasn&#x27;t considered so important until a couple of months ago, and thus, it wouldn&#x27;t <i>matter<\/i> how much money was thrown at them, it wouldn&#x27;t have solved the fundamental <i>priority<\/i> problem.<p>Contra to some of the press, I took the time to read the CDC&#x27;s summary budget from the government&#x27;s website. It wasn&#x27;t hard to find (&quot;Center for Disease Control&quot; budget). It&#x27;s full of things that sound superficially wonderful, but none of it matters if it&#x27;s being spent incompetently or with priorities not connected to the real world, and throwing &quot;more&quot; at such an organization is not a good investment.<p>You can&#x27;t get away from it. It isn&#x27;t about <i>more<\/i>, it&#x27;s also about <i>what<\/i>. <i>What<\/i> matters a <i>lot<\/i>. Again, I&#x27;d be less vocal about not just handing the government <i>more<\/i> if the advocates of <i>more<\/i> would pay more attention... <i>much<\/i> more attention... to <i>what<\/i>, and <i>how well<\/i>. But I can&#x27;t help but notice the advocates of &quot;more&quot; seem to consider that an attack, when in all seriousness they really ought to be <i>leading the charge<\/i>. If you are an advocate of giving the government more, shouldn&#x27;t you consider it very important to your own position that what the government already has be used well? You give away an enormous weapon when you leave it solely to your opponents to point out problems!","7077300":"According to your graph, GINI went up (from 34 to 38%) after taxes and transfers as well.<p><i>Just because a random variable that is the aggregate of many other random variables (college enrollment) is not sufficient to make statements about one of the component random variables (college tuition) does not mean that it&#x27;s unfalsifiable.<\/i><p>So how do you falsify it?<p>Also, I didn&#x27;t ask about a relation between tuition and graduation. I asked about a relation between <i>inequality<\/i> and <i>enrollment<\/i>.<p><i>The underlying paper by Bailey and Dynarski [5] documents pretty clearly that income inequality translates into inequality in educational attainment...<p>Looking at educational <\/i>attainment* as opposed to <i>enrollment<\/i> is a bit, um, confusing. Is it your assertion that a higher GINI somehow makes the poor (specifically poor women, if we go by that paper) less willing to study than their richer counterparts?<p>Not that it matters, since the paper doesn&#x27;t look at inequality at all. All it shows is that higher quintiles have higher graduation rates - this is <i>completely unrelated<\/i> to the question of whether increasing the size of quintiles effects graduation rates.<p>Also, if you read your source [5] (the middle, not the conclusions), you&#x27;d discover that the strongest explanation they have of their results is that <i>children of poorer parents are not as smart as children of rich parents<\/i>, which explains half the gap. So unless your claim is that higher GINI makes poor kids stupid, it&#x27;s nonsensical to claim inequality has anything to do with graduation rates.<p>I give up. You have unfalsifiable beliefs which are somehow supported by academic papers on completely unrelated topics. Not anything for me to learn here.","8338896":"DKIM and SPF are not that hard to set up. And it&#x27;s a low enough barrier for entry considering that&#x27;s all we have to stop spammers.<p>Edit: not sure about SenderID, to be honest.","3450108":"if by whiskey you mean..., then yeah, it&#x27;s amazing.<p><a href=\"http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;If-by-whiskey\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;If-by-whiskey<\/a>","7876314":"It&#x27;s strange - because it would be so easy to make a reasonable one:\n1. Users must give a comment with their endorsement\n2. That comment must be at least 141 characters long.\n3. Allow users to &quot;agree&quot; with endorsements. Let the owner choose the order.","7080513":"I feel compelled to point out that comparing share price alone is <i>terribly, horribly wrong<\/i>.<p>To illustrate, the phrase &quot;BTC is the price of an Apple share&quot; could, by some people, be taken to mean &quot;BitCoin is worth more than Apple&quot;. In reality, the BitCoin market cap right now is $6 billion, and Apple&#x27;s is $472 billion.<p>Comparing shares (and, by extension, the value of BTC) on price alone is worse than useless. Unfortunately many people insist on doing it, especially (at least it seems to me) in the US (which I guess makes sense, since the Dow Jones is weighted not on market cap, but share price, an equally nonsensical way of doing things).","1433165":"Very nice project. I&#x27;m late to the party but here&#x27;s my upvote! :)","5366147":"here&#x27;s an almost comical excerpt from the Cornell study<p><a href=\"http:\/\/iwsp.human.cornell.edu\/file_uploads\/offices1_1238256905.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;iwsp.human.cornell.edu&#x2F;file_uploads&#x2F;offices1_12382569...<\/a><p><i>The data showed that younger workers liked these kinds of offices more than older\nworkers. The reason was instructive: they felt they could learn more from their\n“officemates” in this kind of office. This makes sense, since in interviews a common\nreason for wanting to join a company was the opportunity to work with “great” people.\nHaving great people around, whom you rarely see and even more rarely talk to, is not of\nreal value. Respondents talked about the much greater learning opportunities in a more\nopen environment. Older respondents, in contrast, found it harder to concentrate and\nmore disruptive. It also seemed the case that older respondents were simply comfortable\nwith how they had learned to do things over a number of years, and did well.<\/i><p>Hmm, that&#x27;s one interpretation.<p>Here&#x27;s a simpler interpretation.<p>Younger workers generally aren&#x27;t going to know what they&#x27;re doing and need to ask questions, so being able to ask questions is important to them. Older workers already know what they&#x27;re doing and don&#x27;t need to ask as many questions, so they don&#x27;t really get anything out of it.<p>This BTW, squares exactly with my experience. All the benefit of open floor plans go to employees with the least expertise at the expense of the employees with the most expertise.<p>If you&#x27;re the most talented, expert employee in an office, in general there&#x27;s not going to be anyone in the office that can answer your questions, so an open office doesn&#x27;t buy you anything.","6942329":"Give it an appropriate prioritization in your life.  e.g. &quot;This is more important than X&quot;.\nAnd have in your mind the REASON why it is more important than X.  The secret, that I have read, to success at difficult things is knowing your &quot;why&quot; - Why is this thing more important than X?  What does success look like, and how does that compare to X?<p>Your &quot;why&quot; is what makes you get out of bed in the morning, makes you confront that issue you can&#x27;t resolve, and to resolve it.  If your &quot;why&quot; isn&#x27;t strong enough, you will likely fail.<p>I read a quote a very long time ago that simply said &quot;Imagine if man learned how to use all of that energy, that determination, all his resources that he uses for chasing women ... for something else more important?&quot;","247135":"This is how big companies work.  They want even the smallest task (like, \"viewing documentation for the product we just bought\") to take days and require multiple levels of managerial approval.  Because I guess it's cheaper to have 10 employees doing the same job than it is to get sued if one employee posts confidential information to a blog, or something.  (If you've ever wondered why you only get 0.00025% interest on your savings account... now you know.)<p>(This is being downmodded, but it's really true, at least where I work.  The IT system is set up for HR people and bank tellers, not programmers.  So the programmers just have to deal, because the system isn't setup for \"average joe\" employees to do anything useful.  The good news is, we bought some company that says they won't be able to continue doing business if this stuff doesn't change, and the company we bought is more prestigious than we are ;)","7346926":"As several people keep hammering into my head, inflation is not the same thing as what people would consider &quot;growth&quot;.<p>Depending on your school of economic thought, inflation represents the increase in money supply.  So, if I took away every $1 bill and replaced it with a $100 bill, the willingness of everyone to now pay $100 for a coke is inflation.<p>It seems to be an accepted principle that we want to keep people from hoarding cash, so inflation of ~2% is wanted.  It gives everyone a nice buffer to avoid dipping into deflation.","1762775":"I&#x27;m not sure if any of you have heard of it already, but there&#x27;s also the Silicon Border project announced quite a few years back that was set to be located on the outskirts of Mexicali:\n<a href=\"http:\/\/www.siliconborder.com\/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.siliconborder.com&#x2F;<\/a><p>I remember being really excited when I saw that in the local Imperial Valley Press. So far though I think it&#x27;ll be a project that&#x27;ll still take a number of years to be fully developed but if it does come to pass will be a huge benefit to the local area.","5965413":"Do you get time off to receive training?<p>The &quot;drier&quot; the subject matter the more I like to it to take place at an offsite location where that is all I will doing for several days.<p>Pluralsight certainly is a good resource if you are more diligent than myself at managing your own curriculum.","7687409":"Yes and the whole co-op collapses which is sad. In order to prevent Alice from killing the co-op other members would have to figure out what she was doing and actively stop using her baby sitting services. What is sadder still, once she controlled the coupons, the only way for the co-op to restart and get back to baby-sitting goodness would be to create a new set of coupons and keep her out of it. One would hope she wasn't some sort of socio-path bent on destroying the co-op's ability to function.","5037548":"I am usually something of a Xobni fan, but this facebook 'praise and adoration' is a little over the top. I see a place for charging people to 'follow your lead' or take your advice based on your community reputation, but the article should have talked about this in a broader perspective .There are several reasons why this would be hard to implement within a facebook context AND absolutely no reason why it cannot be done by someone else.","4519948":"Yes, The answer is body lift + speed.","2665333":"Oops, thanks.   Should probably pay closer attention!<p>Maybe this highlights the pitfalls of excessively long writing.  Or more likely the pitfalls of me commenting at 3am :(","4618303":"Design, documentation, database, networking, system operator, installation, project management, repair and tech support just off the top of my head.  There&#x27;s more to computers than just writing code.","623834":"lol, yes.<p>The best thing are the comments in the docs of people telling you how wrong the docs are.","3619347":"The market doesn't punish the companies for irrational behavior when everyone engages in the same irrational behavior.","2817715":"For those who missed it (I was wondering why people were now saying March):<p>\"Apple to Ship Tablet Device in March\"<p><a href=\"http:\/\/online.wsj.com\/article\/SB10001424052748703580904574638630584151614.html\" rel=\"nofollow\">http:\/\/online.wsj.com\/article\/SB1000142405274870358090457463...<\/a>","2776881":"I was going to say the same thing. I probably edit at least 50 percent of my comments here and on reddit within a minute, and delete about 25 percent. Presumably a pause in mail sending would have a similar effect.","2510928":"I loved the BeOS -- happily discarded Mac OS 8 when BeOS PR1 came out -- and I am so happy to see Heiku OS on the front page of Hacker News. To this day, the BeOS is still the OS which brought me the most fun on a day-to-day basis.","4505071":"The Google homepage is only about 20000 bytes... if we assume an maximum segment size of ~1400 bytes, then 14 or 15 packets is about right.<p>I wouldn&#x27;t be surprised if Google is sending the packets all at once and ignoring the ACKs altogether.<p>Heck, there&#x27;s even a 2010 paper from Google on the subject of sending a bunch of packets at the beginning of the connection: <i>An Argument for Increasing TCP&#x27;s Initial Congestion Window<\/i>[0]<p>[0]<a href=\"http:\/\/research.google.com\/pubs\/pub36640.html\" rel=\"nofollow\">http:&#x2F;&#x2F;research.google.com&#x2F;pubs&#x2F;pub36640.html<\/a>","6711279":"As much as the guy annoys me, he knows how to generate publicity.","4537277":"<p><pre><code>    12:00:00.000 - Alice - SELL $10.00\n    12:00:00.100 - Eve - BUY $10.00\n    12:00:00.200 - Eve - SELL $10.01\n    12:00:00.300 - Chuck - BUY $9.95\n    12:00:00.400 - Chris - BUY $9.90\n    12:00:00.500 - Charlise - BUY $9.80\n<\/code><\/pre>\nOops. Compare:<p><pre><code>    12:00:00.000 - Alice - SELL $10.00\n    12:00:00.300 - Chuck - BUY $9.95\n    12:00:00.400 - Chris - BUY $9.90\n    12:00:00.500 - Charlise - BUY $9.80\n<\/code><\/pre>\nEve took the day off. Alice is screwed.","6026747":"&gt; Yeah.. it really doesn&#x27;t. The DoJ would be all over their ass if there was really a case to be made there.<p>This just shows that you don&#x27;t understand what a monopoly is.  Monopolies are not in themselves illegal, so there is no reason for the DoJ to get involved unless they break one of the laws regarding what monopolies can and can&#x27;t do.<p>And, of course they are being investigated for doing exactly that in Europe.","4858533":"No, not if that was not under the original terms of the lease. You may own the building but in the eyes of the law it is the tenant&#x27;s home and you can&#x27;t throw them out onto the streets without due process.","5846040":"I'm 27, with a wife and three kids. I've been working full-time on my own startup for the past 9 months. Without salary.<p>See, there are plenty of us who can kick ass <i>and<\/i> raise a family at the same time. Not to mention plan and budget responsibly. In fact, you might really want to hire people who are good at that sort of thing, rather than the Red Bull-chugging, couch-sleeping, college codemonkey stereotype. But I suppose stereotyping is what got us here in the first place, and that's not fair to Red Bull aficionados.<p>I guess I'd just rather you let me and other prospective employees assess the risks for ourselves. That means frank discussion about clear, accurate information. But don't curtail things because of personal bias.","4621519":"<i>I'd take violent anarchists, Buddhists, and Nazis in a team if I could make it work.<\/i><p>Maybe it wouldn't work on a technology team, but it's an excellent set up for a \"...walk into a bar\" joke.","3588632":"I took issue with the claim that shaping the Singularity is \"the world's most important task\" when there are so many extinction-level threats <i>that already exist<\/i>. It seems arrogant and presumptuous to claim the number one spot for a hypothetical threat that one happens to be deeply involved with.<p>Debating the likelihood of recursively self-improving AI is tedious, usually pointless, and often goes the way of political and religious debate, which could hint at its inclusion in the participants' self definition [1], and I don't have the time or energy to get involved right now.<p>I apologize if I came off as dismissive -- I was frusterated over my initial point. If it matters to you, I certainly haven't completely written off recursively self-improving AI. I just find it extremely unlikely in the near-to-mid future, and think there are other more pressing issues that have the distinction of currently existing.<p>[1] <a href=\"http:\/\/www.paulgraham.com\/identity.html\" rel=\"nofollow\">http:\/\/www.paulgraham.com\/identity.html<\/a>","6814109":"If you see the mania and avoid getting involved, patiently waiting until sanity returns, you can buy more cheaply.  But you are still stuck paying for these insane policies, which cost hundreds of billions.<p>But we are avoiding that too, borrowing a trillion plus bucks a year.  We will ultimately face the music and it will be when all the wiggle room is gone, because they wiggle as much as possible without regard to long term consequences.","1367130":"Strikes create leverage by withholding a service. A discount that put their service on par with taxis in effect provides replacement taxi service.","1702439":"Nice commands. Also &#x27;sips&#x27; for batch resizing images.<p>If you aren&#x27;t on OSX you can try the following for a simple &#x27;say&#x27; alternative. It has some great robotic&#x2F;singing voices, too.<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;Jam3&#x2F;says\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Jam3&#x2F;says<\/a>","609132":"But everything else in the casino is bright and dizzying, too....","2874332":"I was living in Southern California when prop 13 passed by an overwhelming margin.  The people who benefited the most weren't wealthy at all.  Instead, they were retired people on fixed incomes who were being forced by tax increases to move from houses in which they'd lived for three or four decades.<p>Maybe in a state that didn't have both high sales taxes and high income taxes a cap on property taxes wouldn't make sense.  But in California it does.","2798324":"The problem with \/r\/politics is that it's thoroughly dominated by left wing \/ socialist types.  If you show up there and try to have a reasoned debate that promotes a libertarian ideal, for example, you get shouted down and\/or down-voted into oblivion.  By and large, the members there only want to talk to people who already share their own beliefs, they're not really interested in being challenged, in debate, or in rational discourse.","6945104":"I definitely wouldn&#x27;t consider Mesos to be anything like an operating system for the datacenter. That&#x27;s just marketing language and confuses things.<p>Mesos is basically an application scheduler. It doesn&#x27;t  manage the base operating systems or machine provisioning. Mesos is concerned with ensuring that one or multiple applications are launched and running on a cluster of machines.<p>The Saltstack framework is the only thing I know of that would provide all the primitives and control necessary for an operator to truly control a full 5-300,000 node datacenter from one station. It&#x27;s the only thing out there that will allow for super low latency response to commands across the cluster. It also can do configuration management etc if you want, or a lot of people use it to just trigger existing chef&#x2F;puppet jobs.<p>I&#x27;ve been using Saltstack in conjunction with Mesos to build out this full datacenter-as-OS stack. Works... :-)","804961":"Are you talking about the lack of improvements in webapp2 or the lack of improvements in the App Engine Python SDK in general?<p>webapp2 was started outside of Google by Rodrigo Moraes, who has since moved on to other projects. Googlers have contributed to the webapp2 but have never taken the lead.<p>There are probably dozens of WSGI-compatible web frameworks that are under active development and you can choose any one that you like.","5392737":"No TV at all.<p>Use time trackers like Toggl to watch what you do with your time. Cut the fat out.<p>Also get enough sleep. All these answers with sleeping 5 hours a night are bullshit. You cannot do stuff that requires concentration quickly if you are not well-rested.","3577628":"&#62;It has numerous technical shortcomings that other digital cash systems do not have.<p>Care to tell us what it is, or it doesn't exist.<p>Also, you don't sound someone who is doing his PhD, you sound more like someone from some government agency upset about a parallel currency system that has the potential to stop its users from being unknowingly abused of their personal information.<p>In my opinion, If Bitcoins are implemented on a massive scale, then there is a heavy chance that the rich will no longer become richer and the poor will no longer become poorer. If and only if implemented properly, on a massive scale. Right now, we can only hope.","8166065":null,"806058":"That sounds really cool.  Are you really, really wedded to Skype though?  It would be awesome to be able to participate using something open source... :-)","3209539":"&gt;Why would you care?\n&gt;\n&gt; Because unlimited recourse to view, then withdraw payment, torpedoes the system.<p>This sounds a bit like saying libraries are bad for authors? Why would this torpedo the system? Do we know that people would &quot;freeload&quot; to the extent that the system would break down?<p>&gt; Also noted that you&#x27;ve failed to address access issues for the poor, children, researchers, and creatives themselves, all of which a general fee would cover.<p>How so? A child can use a parents account, researchers and creatives can certainly pay? Researchers might get remimbursed of course -- but that&#x27;s immaterial.<p>Certainly poor can pay <i>some<\/i> -- granted, many will not be able to. Let them read for free (by &quot;abusing the refund&quot;) -- and start paying when&#x2F;if they&#x27;re no longer poor?<p>I don&#x27;t see how a flat tax would be any better for the poor, than direct payment? If  a person can afford to spend a dollar, or a thousand dollars on content each month -- that doesn&#x27;t change just because you collect a fee based off of bandwith rather than per-item?<p>Re: payment fraud -- sure, that&#x27;s a real problem, and fraud is something every pay system need to account for. I&#x27;m not sure that credit cards&#x2F;micropayments would be more expensive in this regard than tax -- there&#x27;s plenty of tax fraud too.<p>I&#x27;m mostly concerned with that your model would appear to me to extend the status quo -- where a lot of low quality content get a lot of views, and generate a lot of the profit -- while it&#x27;d be better to have a system that promoted more diverse and &quot;better&quot; content -- generally that&#x27;d be a slide towards more decentralized publishing&#x2F;more personal publishing.<p>This is of course entirely subjective.","1505093":"It likely would work. Facebook heavily hinted at strong social integration with the OR. I likely see Facebook doing this or at least they gave me that impression in their stock holders call.<p>It makes a lot of sense. I certainly would use it. The big &quot;draw&quot; for me. Would be watching movies with my friends, in a full theater settings, despite continents of separation.","3589314":"The real benefit of a login form is you can easily seperate the casual nosy surfer from someone more interested in hacking your site.","7593525":"There is truth in what you say, but you catch more flies with honey than with vinegar. If the wording of your comments makes it seem like you&#x27;re trolling, maybe it&#x27;s time to adjust your wording?<p>As adestefan observes, the problem is not confined to America nowadays either.","8041608":"For me psilocybin is too much of an emotional experience to focus on any abstract problems. I could imagine using cannabis for problem solving — it allows for concentration and focus.","1198632":"Perhaps the developer already knows JavaScript.<p>Also, I'm not sure where you got the idea that you can write iPhone apps in C++, you can't, the API is almost entirely Objective-C and some straight C (though there may be a few C++ APIs)","12844":"We also recently released an early version of the Airtable API. It provides an API that&#x27;s specific to each database you&#x27;ve configured in the app:\n<a href=\"https:\/\/airtable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airtable.com<\/a>\n<a href=\"https:\/\/airtable.com\/api\" rel=\"nofollow\">https:&#x2F;&#x2F;airtable.com&#x2F;api<\/a>","7985559":"I don&#x27;t know if this will improve the quality of HN comments but it will surely reduce the time I spend on this site.<p>I already have to be careful not to upset any moderators and get hell-banned. With comments that won&#x27;t get published if they don&#x27;t please the crowd there&#x27;s no reason to comment any more. And if I can&#x27;t comment, why spend the time reading in the first place?","4780410":"The licensing is really an issue, especially when you get into the higher-end. They don't charge per computer, they charge <i>per CPU<\/i>. So you'll have to pay 4x as much in a dual CPU system (I'm not sure if they have a similar licensing structure for dual-core or quad-core systems)","59473":"Maybe not my real phone number but Google Voice number? Sure, who cares?","7129412":"The license on the TextSecure app is GPLv3. What would you like to do with TextSecure that this license prohibits?","3420420":"This is the guy who wanted to use a small RTOS on the iPhone rather than the full OS X. And thankfully lost that battle.","3447803":"&#62; <i>Including things like how good your landing page is.<\/i><p>That will impact CPA, not CPC.","3679104":"Why are the checkout pages even public? \nNo robots.txt, a lot of private information listed and public.<p>Shameful. I know little about web development but this seems rather obvious, even to me.","3084483":null,"6704407":"Interesting, while there may be similarities between the stoic approach and extant Buddhist teachings, I&#x27;m going to go out on a limb and say that a stoic would never write something like this:<p>Four and fifty years\nI&#x27;ve hung the sky with stars.\nNow I leap through –\nWhat shattering!<p>Eihei Dogen (death poem)<p>Buddhist logic seems to have religious experience as its foundation.","6455944":"one foot in each<p>I use facebook and Orkut. Sure, I use one more than the other, but there's possibility for that to shift because I'm free to use both.","2922172":null,"7058780":"Everyone is in on it. Even kindergartens. Do you remember how you were taught in kindergarten to exercise proper hygiene? Turns out that they are really just the gov&#x27;t&#x27;s tool to brainwash (pun intended) you into using soap.","6778898":"Great now we can dump all that modern OO rubbish and get back to REAL programming :-)","5951719":"Move to Australia and work for the Government... I know plenty of developers earning AUD$80+\/hr on 2000hr\/yr contracts (i.e. earning approx. AUD$160k\/yr).","5066024":"You projected your desire of getting work done onto the company's desire to keep people working.<p>Full time employees need to be 'busy' all of the time to justify investments the company makes in each person (opportunity to learn on the job is the biggest investment). If you go there and finish all of the work, there won't be anything left for the FTEs to do.<p>You're better off giving FTEs (full time employees) learning opportunities and telling them they are really bright.<p>And don't burn bridges - just fake it and pretend to be nice - life sometimes works out in really strange ways.","6304528":"I work for a VERY large financial company and we have space issues. In some areas people are required to work from home 1-2 days a week. Our legal department is very strict, so I don&#x27;t think this would be happening if compliance was really an issue.","1205539":"If someone presents himself to me as a professional cook and then proceeds to over-salt the food, yes, I do feel completely comfortable disregarding his culinary opinions from that point forward.","7008040":"Aaahh tried and true, good strategy, First scare the shit out, and then tell them(people) we are here to protect you, look we need to come into your house now, so that we can save you.","3111037":"Headline is inaccurate; Cyanogen's tweet is in no way a promised release date for anything. Although I'd still bet good money that the CM team will have a stable ICS build out well before most manufacturers.","1183776":"Try Reddit. Wider audience.","8009837":"If you are using C++ (even without exceptions), then RAII (Resource Acquisition Is Initialization) with resources freed in local variables' destructors is a better solution.","3673788":"But.. ..but he&#x27;s<p>&gt; reading on an iPad, so the risk of system infection is negligible.","3798395":"When Android gets to &#x27;T&#x27;, they <i>have<\/i> to choose TicTac.","5386997":"You should get in contact with the Spotify guys. Seriously.<p>I am more than impressed by this UI. It reminds me of Rdio's UI, which I find to be better than iTunes. Spotify needs a good designer like you.","8212604":"Sure, but that will require users to get used to a different layout. Dvorak (<a href=\"http:\/\/en.wikipedia.org\/wiki\/Dvorak_Simplified_Keyboard\" rel=\"nofollow\">http:\/\/en.wikipedia.org\/wiki\/Dvorak_Simplified_Keyboard<\/a>) does this. It isn't very popular though, as it's few people want to spend time relearning how to touch type.","7759142":"This seems like the most straight forward argument, and far more germane to Rice&#x27;s role at Dropbox as a continuation of her role as National Security Adviser. There she was expected to provide independent advice to the President. Now she&#x27;s expected to provide independent advice to the CEO and Board. The worry is she either got rolled by more strident hawks in the Bush Administration or went along willingly because she believed the arguments. Neither explanation encourages much faith in her role as an independent director at a company with lots of my data.","2901579":"The letdown of Hulu Plus and the horrendous monstrosity that is Netflix (and its even worse iPad app) are at least movements in the right direction. I find solace in the mere <i>idea<\/i> that one day I might be able to go to a website, select an episode, and watch television content on my computer screen.<p>I don't know why this is so hard. I am willing to pay money for it! I will open my wallet and pay money to watch TV on my computer! Even with ads!","7980782":"Once you move from storing session data in-memory on the webserver, and add a network call, why not just store the data alongside the users other data in a fast datastore? That could be Redis, Cassandra, whatever.<p>This isn't babble -- it's honestly a pretty common technique. If your site sees millions of users, storing a session for visitors that aren't logged in is prohibitive and unnecessary. You can store UI customizations and basic memoization in a client-side cookie if you need to.<p>If you're building something small or basic, then you probably won't have multiple webservers and you can use fast in-memory sessions without concern. This only applies once you need to worry about scale.","7141726":"Spain's government finances were not unsustainable prior to the recession. In fact, they were in pretty good shape. Spain did, however, face a crippling housing bubble due to the surge of outside investment.","1872293":"No, not true. There are government and non-government attacks. Even if we assume cloud services are more vulnerable to government snooping, we need to also consider that many more companies and individuals suffer more damage from regular criminal hackers than from the NSA. Avoiding a small risk by increasing your exposure to a large risk is not rational.","5866007":"hmmm i wonder how many people they did this research on.  i actually wanna see this research being done on people that are under the influence since you tend to be more touchy when you're drunk or on drugs...like...coke or even prescription meds","7440507":"At least it seems reasonably efficient. The bitmap is composed of 106 * 17 = 1802 bits, while the digits contain 543 * log2(10) = 1803.8 bits; not bad, disregarding redundancy in the image."}}